_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_MSP_НастройкаСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранитьНастройкиВEXCEL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьEXCEL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоНаименованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоДополнительнымРеквизитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаMSPНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСтатусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ИтогиПоГлавамСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ИтогиПоГлавамСС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_ИтогиПоГлавам</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыЗатратСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ИтогиПоГлавамОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ИтогиПоГлавамОС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ИтогиПоГлавам</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыЗатратСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации/Forms/ФормаРабочийСтол/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущийДокумент, ТекущаяСтройка;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//ОбщегоНазначения.ПриСозданииНаСервере(этаФорма, Отказ, СтандартнаяОбработка);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = СМ_ЗащитаКлиент.ЗапускОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьДеревоСмет" Тогда
		//  Сохранение текущей строки дерева
		СтрокаДерева 	= Неопределено;
		ТекДанные 		= Элементы.СписокСметы.ТекущиеДанные;
		СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(СтрокаДерева, ТекДанные, Элементы.СписокСметы, СписокСметы.ПолучитьЭлементы(),"Смета");
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.Свойство("Смета") Тогда
				ТекСмета = Параметр.Смета;
				Если ЗначениеЗаполнено(ТекСмета) Тогда
					СтрокаДерева.ТекущийЭлемент = ТекСмета;
				КонецЕсли;
				ОбновитьПодчиненныеНаСервере(ТекСмета);
				Если Параметр.Свойство("Стройка") Тогда
					ТекСтройка =  Параметр.Стройка;
					Если Элементы.РежимОтображенияДерева.Пометка Тогда
						Элементы.СписокОбъектыСтроительства.ТекущаяСтрока = Параметр.Стройка;
						ОбновитьДеревоСметСервер(Параметр.Стройка);
					Иначе
						ОбновитьДеревоСметСервер();
					КонецЕсли;
				Иначе
					ОбновитьДеревоСметСервер();
				КонецЕсли;
			ИначеЕсли Параметр.Свойство("Стройка") Тогда
				ТекСтройка =  Параметр.Стройка;
				Если Элементы.РежимОтображенияДерева.Пометка Тогда
					ОбновитьДеревоСметСервер(Параметр.Стройка);
				Иначе
					ОбновитьДеревоСметСервер();
				КонецЕсли;
			Иначе
				ОбновитьДеревоСметСервер();
			КонецЕсли;
		Иначе
			Если Элементы.РежимОтображенияДерева.Пометка Тогда
				ОбновитьДеревоСметСервер(Элементы.СписокОбъектыСтроительства.ТекущаяСтрока);
			Иначе
				ОбновитьДеревоСметСервер();
			КонецЕсли;
		КонецЕсли;
		
		//  Восстановление текущей строки дерева
		Если СтрокаДерева <> Неопределено Тогда
			СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.СписокСметы, СписокСметы.ПолучитьЭлементы(), СписокСметы, СтрокаДерева, "Смета");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыСтроительства

&НаКлиенте
Процедура СписокОбъектыСтроительстваПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокОбъектыСтроительства.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПредыдущаяСтройка = ТекущаяСтройка;
		ТекущаяСтройка = ТекДанные.Ссылка;
		Если ТекущаяСтройка <> ПредыдущаяСтройка Тогда
			ТекОбъект2 = ТекДанные.Ссылка;       	
			Если Не Необновлять Тогда
				ОбновитьДеревоСметСервер(ТекОбъект2);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСметы

&НаКлиенте
Процедура СписокСметыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьСмету();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	
	ТекДанные = Элементы.СписокОбъектыСтроительства.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбновитьДеревоСметСервер();
	Иначе
		ОбновитьДеревоСметСервер(ТекДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияДерева(Команда)
	
	Элементы.РежимОтображенияДерева.Пометка = Не Элементы.РежимОтображенияДерева.Пометка;
	Если Элементы.РежимОтображенияДерева.Пометка Тогда
		Элементы.СписокОбъектыСтроительства.Видимость = Истина;
		ТекДанные = Элементы.СписокОбъектыСтроительства.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			ОбновитьДеревоСметСервер(ТекущаяСтройка);
		Иначе
			ОбновитьДеревоСметСервер(ТекДанные.Ссылка);
		КонецЕсли;
	Иначе
		Элементы.СписокОбъектыСтроительства.Видимость = Ложь;
		ОбновитьДеревоСметСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСметы(Команда)
	
	ТекДанные = Элементы.СписокОбъектыСтроительства.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выделите объект строительства");
	ИначеЕсли ЭтоГруппа(ТекДанные.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка не производится для группы объектов");
	иначе
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектСтроительства",ТекДанные.Ссылка);
		ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаВыгрузки",СтруктураПараметров);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьДеревоСметСервер(ТекОбъект = Неопределено)
	
	ТабРезультат = ПолучитьДеревоСмет(ТекОбъект);
	ТабРезультат.Сортировать("Сортировка Возр, Родитель Убыв, Смета Возр");
		
	ДеревоЗначений = РеквизитФормыВЗначение("СписокСметы", Тип("ДеревоЗначений"));
	ДеревоЗначений.Строки.Очистить();
	
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Родитель) Тогда
			НайденнаяСтрока = ДеревоЗначений.Строки.Найти(ТекСтрока.Родитель,"Смета",Истина);	
			Если НайденнаяСтрока <> Неопределено Тогда
				СтрокаДерева = НайденнаяСтрока.Строки.Добавить();	
			Иначе
				СтрокаДерева = ДеревоЗначений.Строки.Добавить();	
			КонецЕсли;			
		Иначе
			СтрокаДерева = ДеревоЗначений.Строки.Добавить();	
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(СтрокаДерева,ТекСтрока);
		
		СтрокаДерева.Картинка 		 = ПолучитьКартинкуСтроки(СтрокаДерева.Ссылка, СтрокаДерева.ПометкаУдаления);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"СписокСметы");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуСтроки(ТекЭлемент, ПометкаУдаления)
	
	// 0. Лим затрата
	// 1. СС
	// 2. ОС
	// 3. ЛС (ресурсный метод)
	// 4. ЛС (базисно инд метод)
	// 5. ЛС просто	
	
	// С пометкой удаления
	// 6. Лим затрата
	// 7. СС
	// 8. ОС
	// 9. ЛС (ресурсный метод)
	// 10. ЛС (базисно инд метод)
	// 11. ЛС просто	
	
	//	КОРРЕКТИРОВКА
	//	18. ЛС (ресурсный метод).
	//	19. ЛС (базисно инд метод).
	//	20. ЛС просто.
	//	21. ПОМЕТКА УДАЛЕНИЯ ЛС (ресурсный метод).
	//	22. ПОМЕТКА УДАЛЕНИЯ ЛС (базисно инд метод).
	//	23. ПОМЕТКА УДАЛЕНИЯ ЛС просто.
	//	24. ПРОВЕДЕН ЛС (ресурсный метод).
	//	25. ПРОВЕДЕН ЛС (базисно инд метод).
	//	26. ПРОВЕДЕН ЛС просто.
	
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Если ТекЭлемент.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			Если ЗначениеЗаполнено(ТекЭлемент.КорректируетСмету) тогда
				ТекКартинка = ?(ПометкаУдаления,21,?(ТекЭлемент.Проведен,24,18));
				Возврат ТекКартинка;
			Иначе
				ТекКартинка = ?(ПометкаУдаления,9,?(ТекЭлемент.Проведен,15,3));
				Возврат ТекКартинка;	
			КонецЕсли;
		ИначеЕсли ТекЭлемент.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
			Если ЗначениеЗаполнено(ТекЭлемент.КорректируетСмету) тогда
				ТекКартинка = ?(ПометкаУдаления,22,?(ТекЭлемент.Проведен,25,19));
				Возврат ТекКартинка;
			Иначе
				ТекКартинка = ?(ПометкаУдаления,10,?(ТекЭлемент.Проведен,16,4));
				Возврат ТекКартинка;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекЭлемент.КорректируетСмету) тогда
				ТекКартинка = ?(ПометкаУдаления,23,?(ТекЭлемент.Проведен,26,20));
				Возврат ТекКартинка;
			Иначе
				ТекКартинка = ?(ПометкаУдаления,11,?(ТекЭлемент.Проведен,17,5));
				Возврат ТекКартинка;
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекКартинка = ?(ПометкаУдаления,8,?(ТекЭлемент.Проведен,14,2));
		Возврат ТекКартинка;
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ТекКартинка = ?(ПометкаУдаления,7,?(ТекЭлемент.Проведен,13,1));
		Возврат ТекКартинка;
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		ТекКартинка = ?(ПометкаУдаления,6,0);
		Возврат ТекКартинка;
	Иначе
		Возврат	5;
	КонецЕсли;	
		
КонецФункции

&НаСервере
Функция ПолучитьДеревоСмет(ТекОбъект3)
	
	Запрос = Новый Запрос;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета,
	               |	СУММА(1) КАК КоличествоАктов
	               |ПОМЕСТИТЬ АктыСметы
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот ГДЕ	СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ  ";
				    Если ЗначениеЗаполнено(ТекОбъект3) Тогда
						ТекстЗапроса = ТекстЗапроса + " И СМ_АктВыполненныхРабот.Стройка В Иерархии (&ОбъектСтроительства)";			
					КонецЕсли;
	               ТекстЗапроса = ТекстЗапроса + "
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета
	               |;
	               |
	               |// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АктыСметы.ЛокальнаяСмета,
	               |	ВЫБОР
	               |		КОГДА АктыСметы.КоличествоАктов > 1
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК КартинкаАкт
	               |ПОМЕСТИТЬ СметыКартинкиАкты
	               |ИЗ
	               |	АктыСметы КАК АктыСметы
	               |;
	               |
	               |// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_СводнаяСмета.Ссылка КАК Смета,
	               |	СМ_СводнаяСмета.Ссылка КАК Ссылка,
	               |	"""" КАК Родитель,
	               |	СМ_СводнаяСмета.Стройка,
	               |	СМ_СводнаяСмета.НомерСметы,
	               |	СМ_СводнаяСмета.Наименование,
	               |	СМ_СводнаяСмета.ПометкаУдаления,
	               |	ИтогПоСС.СуммаБазис,
	               |	ИтогПоСС.СуммаТек,
				   |	1 КАК Сортировка,
				   |	0 КАК КартинкаАкты,
				   |	СМ_СводнаяСмета.Автор,
				   |	СМ_СводнаяСмета.Заказчик,
				   |	СМ_СводнаяСмета.Инвестор,
				   |	СМ_СводнаяСмета.Подрядчик,
				   |	НЕОПРЕДЕЛЕНО КАК Район,
				   |	ЛОЖЬ КАК Методика1984,
				   |	ЛОЖЬ КАК МетодикаТСН
				   |ИЗ
	               |	Документ.СМ_СводнаяСмета КАК СМ_СводнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавамСС.Смета КАК Смета,
	               |			СУММА(СМ_ИтогиПоГлавамСС.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавамСС.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавамСС КАК СМ_ИтогиПоГлавамСС
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавамСС.Итог = &ИтогПоСмете
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавамСС.Смета) КАК ИтогПоСС
	               |		ПО СМ_СводнаяСмета.Ссылка = ИтогПоСС.Смета";

	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ СМ_СводнаяСмета.Стройка В Иерархии (&ОбъектСтроительства)";			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ОбъектнаяСмета.Ссылка КАК Смета,
	|	СМ_ОбъектнаяСмета.Ссылка КАК Ссылка,
	|	СМ_ОбъектнаяСмета.ИДРодителя КАК Родитель,
	|	СМ_ОбъектнаяСмета.Стройка,
	|	СМ_ОбъектнаяСмета.НомерСметы,
	|	СМ_ОбъектнаяСмета.Наименование,
	|	СМ_ОбъектнаяСмета.ПометкаУдаления,
	| 	ИтогПоОС.СуммаБазис,
	| 	ИтогПоОС.СуммаТек,
	|	2 КАК Сортировка,
	|	0,
	|	СМ_ОбъектнаяСмета.Автор,
	|	СМ_ОбъектнаяСмета.Заказчик,
	|	СМ_ОбъектнаяСмета.Инвестор,
	|	СМ_ОбъектнаяСмета.Подрядчик,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета 
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	|	(ВЫБРАТЬ 
	|		СМ_ИтогиПоГлавам.Смета КАК Смета,
	|		Сумма(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	|		Сумма(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	|	ИЗ
	|		РегистрСведений.СМ_ИтогиПоГлавамОС КАК СМ_ИтогиПоГлавам
	|	ГДЕ
	|		СМ_ИтогиПоГлавам.Итог = &ИтогПоСмете
	|	СГРУППИРОВАТЬ ПО 
	|		СМ_ИтогиПоГлавам.Смета) КАК ИтогПоОС	
	|	ПО СМ_ОбъектнаяСмета.Ссылка = ИтогПоОС.Смета";
	
	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ	СМ_ОбъектнаяСмета.Стройка  В Иерархии (&ОбъектСтроительства) ИЛИ СМ_ОбъектнаяСмета.ИДРодителя.Стройка В Иерархии (&ОбъектСтроительства)";			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	СМ_ЛокальнаяСмета.Ссылка КАК Смета,
	|	СМ_ЛокальнаяСмета.Ссылка КАК Ссылка,	
	|	СМ_ЛокальнаяСмета.ИДРодителя КАК Родитель,
	|	СМ_ЛокальнаяСмета.Стройка,
	|	СМ_ЛокальнаяСмета.НомерСметы,
	|	СМ_ЛокальнаяСмета.Наименование,
	|	СМ_ЛокальнаяСмета.ПометкаУдаления,
	| 	ИтогПоЛС.СуммаБазис,
	| 	ИтогПоЛС.СуммаТек,
	|	3 КАК Сортировка,
	|	ЕСТЬNULL(СметыКартинкиАкты.КартинкаАкт, 0),
	|	СМ_ЛокальнаяСмета.Автор,
	|	СМ_ЛокальнаяСмета.Заказчик,
	|	СМ_ЛокальнаяСмета.Инвестор,
	|	СМ_ЛокальнаяСмета.Подрядчик,
	|	СМ_ЛокальнаяСмета.Район,
	|	СМ_ЛокальнаяСмета.Методика1984,
	|	СМ_ЛокальнаяСмета.МетодикаТСН
	|ИЗ
	|	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	|	(ВЫБРАТЬ 
	|		СМ_ИтогиПоГлавам.Смета КАК Смета,
	|		Сумма(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	|		Сумма(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	|	ИЗ
	|		РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	|	ГДЕ
	|		СМ_ИтогиПоГлавам.Итог = &ИтогПоСмете
	|	СГРУППИРОВАТЬ ПО 
	|		СМ_ИтогиПоГлавам.Смета) КАК ИтогПоЛС	
	|	ПО СМ_ЛокальнаяСмета.Ссылка = ИтогПоЛС.Смета
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	| СметыКартинкиАкты КАК СметыКартинкиАкты
	|	ПО СМ_ЛокальнаяСмета.Ссылка = СметыКартинкиАкты.ЛокальнаяСмета
	|	ГДЕ 
	|	СМ_ЛокальнаяСмета.СметаРассчитана = ЛОЖЬ ";
	
	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " И (СМ_ЛокальнаяСмета.Стройка В Иерархии (&ОбъектСтроительства) ИЛИ СМ_ЛокальнаяСмета.ИДРодителя.Стройка В Иерархии (&ОбъектСтроительства))";			
	КонецЕсли;

	//  Лимитированные затраты по локальным сметам  
	ТекстЗапроса = ТекстЗапроса + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка КАК Смета,
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка КАК Ссылка,	
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка КАК Родитель,
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.Стройка КАК Стройка, 
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование КАК НомерСметы,
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование КАК Наименование,
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	| 	ЛимЗатратыЛС.СуммаБазис,
	| 	ЛимЗатратыЛС.СуммаТек,
	|	4 КАК Сортировка,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СМ_ЛокальнаяСмета.ЛимитированныеЗатраты КАК СМ_ЛокальнаяСметаЛимитированныеЗатраты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	|	(ВЫБРАТЬ
	|		СМ_ИтогиПоГлавам.Смета,
	|		СМ_ИтогиПоГлавам.Итог КАК Итог,
	|		Сумма(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	|		Сумма(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	|	ИЗ 
	|		РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	|	ГДЕ
	|		СМ_ИтогиПоГлавам.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты  
	|		И СМ_ИтогиПоГлавам.Смета ССЫЛКА Документ.СМ_ЛокальнаяСмета
	|	СГРУППИРОВАТЬ ПО 
	|		СМ_ИтогиПоГлавам.Смета,
	|		СМ_ИтогиПоГлавам.Итог) КАК ЛимЗатратыЛС
	|	ПО СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыЛС.Смета 
	|	   И СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата = ЛимЗатратыЛС.Итог
	|ГДЕ 
	|	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Расчет = ИСТИНА  
	|	И СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.СметаРассчитана = ЛОЖЬ 
	|	И СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата <> &ПустаяЛЗ"; 
	
	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.Стройка В Иерархии (&ОбъектСтроительства)";			
	КонецЕсли;
	
	//  Лимитированные затраты по сводным сметам  
	ТекстЗапроса = ТекстЗапроса + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка КАК Смета,
	|	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка КАК Ссылка,	
	|	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка КАК Родитель,
	|	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка.Стройка КАК Стройка, 
	|	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование КАК НомерСметы,
	|	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование КАК Наименование,
	|	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления КАК ПометкаУдаления,
	| 	ЛимЗатратыСС.СуммаБазис,
	| 	ЛимЗатратыСС.СуммаТек,
	|	4 КАК Сортировка,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.СМ_СводнаяСмета.ЛимитированныеЗатраты КАК СМ_СводнаяСметаЛимитированныеЗатраты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	|	(ВЫБРАТЬ
	|		СМ_ИтогиПоГлавамСС.Смета,
	|		СМ_ИтогиПоГлавамСС.Итог КАК Итог,
	|		Сумма(СМ_ИтогиПоГлавамСС.ПрямЗатраты) КАК СуммаБазис,
	|		Сумма(СМ_ИтогиПоГлавамСС.ТекПрямЗатраты) КАК СуммаТек
	|	ИЗ 
	|		РегистрСведений.СМ_ИтогиПоГлавамСС КАК СМ_ИтогиПоГлавамСС
	|	ГДЕ
	|		СМ_ИтогиПоГлавамСС.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты И 
	|		СМ_ИтогиПоГлавамСС.Смета ССЫЛКА Документ.СМ_СводнаяСмета
	|	СГРУППИРОВАТЬ ПО 
	|		СМ_ИтогиПоГлавамСС.Смета,
	|		СМ_ИтогиПоГлавамСС.Итог) КАК ЛимЗатратыСС
	|	ПО СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыСС.Смета
	|	   И СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата = ЛимЗатратыСС.Итог
	|ГДЕ 
	|	СМ_СводнаяСметаЛимитированныеЗатраты.Расчет = ИСТИНА 
	|	И СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата <> &ПустаяЛЗ"; 
	
	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка.Стройка В Иерархии (&ОбъектСтроительства)";			
	КонецЕсли;
	
	//  Лимитированные затраты по объектным сметам  
	ТекстЗапроса = ТекстЗапроса + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка КАК Смета,
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка КАК Ссылка,	
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка КАК Родитель,
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка.Стройка КАК Стройка, 
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование КАК НомерСметы,
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование КАК Наименование,
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.ПометкаУдаления КАК ПометкаУдаления,
	| 	ЛимЗатратыОС.СуммаБазис,
	| 	ЛимЗатратыОС.СуммаТек,
	|	4 КАК Сортировка,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.СМ_ОбъектнаяСмета.ЛимитированныеЗатраты КАК СМ_ОбъектнаяСметаЛимитированныеЗатраты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|
	|	(ВЫБРАТЬ
	|		СМ_ИтогиПоГлавамОС.Смета,
	|		СМ_ИтогиПоГлавамОС.Итог КАК Итог,
	|		Сумма(СМ_ИтогиПоГлавамОС.ПрямЗатраты) КАК СуммаБазис,
	|		Сумма(СМ_ИтогиПоГлавамОС.ТекПрямЗатраты) КАК СуммаТек
	|	ИЗ 
	|		РегистрСведений.СМ_ИтогиПоГлавамОС КАК СМ_ИтогиПоГлавамОС
	|	ГДЕ
	|		СМ_ИтогиПоГлавамОС.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты  
	|		И СМ_ИтогиПоГлавамОС.Смета ССЫЛКА Документ.СМ_ОбъектнаяСмета
	|	СГРУППИРОВАТЬ ПО 
	|		СМ_ИтогиПоГлавамОС.Смета,
	|		СМ_ИтогиПоГлавамОС.Итог) КАК ЛимЗатратыОС
	|	ПО СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыОС.Смета 
	|	   И СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата = ЛимЗатратыОС.Итог
	|ГДЕ 
	|	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Расчет = ИСТИНА  
	|	И СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата <> &ПустаяЛЗ"; 

	Если ЗначениеЗаполнено(ТекОбъект3) Тогда
		ТекстЗапроса = ТекстЗапроса + " И СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка.Стройка В Иерархии (&ОбъектСтроительства)";			
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	ИтогПоСмете = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИтогСметыДляДерева");
	Если Не ИтогПоСмете = Неопределено
		И ИтогПоСмете.Пустая() Тогда
		ИтогПоСмете = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП4");
	КонецЕсли;
	Запрос.УстановитьПараметр("ИтогПоСмете",ИтогПоСмете);
	Запрос.УстановитьПараметр("ОбъектСтроительства",ТекОбъект3);
	Запрос.УстановитьПараметр("ПустаяЛЗ",Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка());

	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
	
КонецФункции

&НаСервере
Функция ПолучитьПодчиненныеДокументы(ТекДокумент)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета,
	               |	СУММА(1) КАК КоличествоАктов
	               |ПОМЕСТИТЬ АктыСметы
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	               |ГДЕ
	               |	СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ
	               |	И СМ_АктВыполненныхРабот.Стройка = &ОбъектСтроительства
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета
	               |;
	               |
	               |// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
	               |ВЫБРАТЬ
	               |	АктыСметы.ЛокальнаяСмета,
	               |	ВЫБОР
	               |		КОГДА АктыСметы.КоличествоАктов > 1
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК КартинкаАкт
	               |ПОМЕСТИТЬ СметыКартинкиАкты
	               |ИЗ
	               |	АктыСметы КАК АктыСметы
	               |;
	               |
	               |// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
	               |ВЫБРАТЬ
	               |	СМ_ОбъектнаяСмета.Ссылка КАК Смета,
	               |	СМ_ОбъектнаяСмета.Ссылка КАК Ссылка,
	               |	СМ_ОбъектнаяСмета.ИДРодителя КАК Родитель,
	               |	СМ_ОбъектнаяСмета.Стройка,
	               |	СМ_ОбъектнаяСмета.НомерСметы,
	               |	СМ_ОбъектнаяСмета.Наименование,
	               |	СМ_ОбъектнаяСмета.ПометкаУдаления,
	               |	2 КАК Сортировка,
	               |	0 КАК КартинкаАкты,
	               |	ИтогПоОС.СуммаБазис,
	               |	ИтогПоОС.СуммаТек
	               |ИЗ
	               |	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавам.Смета КАК Смета,
	               |			СУММА(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавамОС КАК СМ_ИтогиПоГлавам
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавам.Итог = &ИтогПоСмете
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавам.Смета) КАК ИтогПоОС
	               |		ПО СМ_ОбъектнаяСмета.Ссылка = ИтогПоОС.Смета
	               |ГДЕ
	               |	СМ_ОбъектнаяСмета.ИДРодителя = &ТекДокумент
	               |	И СМ_ОбъектнаяСмета.Стройка = &ОбъектСтроительства
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ЛокальнаяСмета.Ссылка,
	               |	СМ_ЛокальнаяСмета.Ссылка,
	               |	СМ_ЛокальнаяСмета.ИДРодителя,
	               |	СМ_ЛокальнаяСмета.Стройка,
	               |	СМ_ЛокальнаяСмета.НомерСметы,
	               |	СМ_ЛокальнаяСмета.Наименование,
	               |	СМ_ЛокальнаяСмета.ПометкаУдаления,
	               |	3,
	               |	ЕСТЬNULL(СметыКартинкиАкты.КартинкаАкт, 0),
	               |	ИтогПоЛС.СуммаБазис,
	               |	ИтогПоЛС.СуммаТек
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавам.Смета КАК Смета,
	               |			СУММА(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавам.Итог = &ИтогПоСмете
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавам.Смета) КАК ИтогПоЛС
	               |		ПО СМ_ЛокальнаяСмета.Ссылка = ИтогПоЛС.Смета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СметыКартинкиАкты КАК СметыКартинкиАкты
	               |		ПО (СметыКартинкиАкты.ЛокальнаяСмета = СМ_ЛокальнаяСмета.Ссылка)
	               |ГДЕ
	               |	СМ_ЛокальнаяСмета.Стройка = &ОбъектСтроительства
	               |	И (СМ_ЛокальнаяСмета.ИДРодителя = &ТекДокумент
	               |			ИЛИ СМ_ЛокальнаяСмета.ИДРодителя.ИДРодителя = &ТекДокумент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.Стройка,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование,
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.ПометкаУдаления,
	               |	4,
	               |	0,
	               |	ЛимЗатратыЛС.СуммаБазис,
	               |	ЛимЗатратыЛС.СуммаТек
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета.ЛимитированныеЗатраты КАК СМ_ЛокальнаяСметаЛимитированныеЗатраты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавам.Смета КАК Смета,
	               |			СМ_ИтогиПоГлавам.Итог КАК Итог,
	               |			СУММА(СМ_ИтогиПоГлавам.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавам.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты
	               |			И СМ_ИтогиПоГлавам.Смета ССЫЛКА Документ.СМ_ЛокальнаяСмета
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавам.Смета,
	               |			СМ_ИтогиПоГлавам.Итог) КАК ЛимЗатратыЛС
	               |		ПО СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыЛС.Смета
	               |			И СМ_ЛокальнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка = ЛимЗатратыЛС.Итог
	               |ГДЕ
	               |	СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.Стройка = &ОбъектСтроительства
	               |	И (СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка = &ТекДокумент
	               |			ИЛИ СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.ИДРодителя = &ТекДокумент
	               |			ИЛИ СМ_ЛокальнаяСметаЛимитированныеЗатраты.Ссылка.ИДРодителя.ИДРодителя = &ТекДокумент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка.Стройка,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование,
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка.ПометкаУдаления,
	               |	4,
	               |	0,
	               |	ЛимЗатратыОС.СуммаБазис,
	               |	ЛимЗатратыОС.СуммаТек
	               |ИЗ
	               |	Документ.СМ_ОбъектнаяСмета.ЛимитированныеЗатраты КАК СМ_ОбъектнаяСметаЛимитированныеЗатраты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавамОС.Смета КАК Смета,
	               |			СМ_ИтогиПоГлавамОС.Итог КАК Итог,
	               |			СУММА(СМ_ИтогиПоГлавамОС.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавамОС.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавамОС КАК СМ_ИтогиПоГлавамОС
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавамОС.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты
	               |			И СМ_ИтогиПоГлавамОС.Смета ССЫЛКА Документ.СМ_ОбъектнаяСмета
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавамОС.Смета,
	               |			СМ_ИтогиПоГлавамОС.Итог) КАК ЛимЗатратыОС
	               |		ПО СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыОС.Смета
	               |			И СМ_ОбъектнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка = ЛимЗатратыОС.Итог
	               |ГДЕ
	               |	СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка.Стройка = &ОбъектСтроительства
	               |	И СМ_ОбъектнаяСметаЛимитированныеЗатраты.Ссылка = &ТекДокумент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка.Стройка,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Обоснование,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Наименование,
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	               |	4,
	               |	0,
	               |	ЛимЗатратыСС.СуммаБазис,
	               |	ЛимЗатратыСС.СуммаТек
	               |ИЗ
	               |	Документ.СМ_СводнаяСмета.ЛимитированныеЗатраты КАК СМ_СводнаяСметаЛимитированныеЗатраты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СМ_ИтогиПоГлавамСС.Смета КАК Смета,
	               |			СМ_ИтогиПоГлавамСС.Итог КАК Итог,
	               |			СУММА(СМ_ИтогиПоГлавамСС.ПрямЗатраты) КАК СуммаБазис,
	               |			СУММА(СМ_ИтогиПоГлавамСС.ТекПрямЗатраты) КАК СуммаТек
	               |		ИЗ
	               |			РегистрСведений.СМ_ИтогиПоГлавамСС КАК СМ_ИтогиПоГлавамСС
	               |		ГДЕ
	               |			СМ_ИтогиПоГлавамСС.Итог ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты
	               |			И СМ_ИтогиПоГлавамСС.Смета ССЫЛКА Документ.СМ_СводнаяСмета
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СМ_ИтогиПоГлавамСС.Смета,
	               |			СМ_ИтогиПоГлавамСС.Итог) КАК ЛимЗатратыСС
	               |		ПО СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка = ЛимЗатратыСС.Смета
	               |			И СМ_СводнаяСметаЛимитированныеЗатраты.ЛимитированнаяЗатрата.Ссылка = ЛимЗатратыСС.Итог
	               |ГДЕ
	               |	СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка.Стройка = &ОбъектСтроительства
	               |	И СМ_СводнаяСметаЛимитированныеЗатраты.Ссылка = &ТекДокумент";
				   
	Запрос.Текст = ТекстЗапроса;
	ИтогПоСмете = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИтогСметыДляДерева");
	Если Не ИтогПоСмете = Неопределено
		И ИтогПоСмете.Пустая() Тогда
		ИтогПоСмете = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП4");
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекДокумент",ТекДокумент);
	Запрос.УстановитьПараметр("ИтогПоСмете",ИтогПоСмете);
	Запрос.УстановитьПараметр("ОбъектСтроительства",ТекДокумент.Стройка);
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
	
КонецФункции

&НаСервере
Процедура ОбновитьПодчиненныеНаСервере(ТекЭлемент)

	Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		Возврат;	
	КонецЕсли;
	
	ТабРезультат = ПолучитьПодчиненныеДокументы(ТекЭлемент);
	ТабРезультат.Сортировать("Сортировка Возр, Родитель Убыв, Смета Возр");
		
	ДеревоЗначений = РеквизитФормыВЗначение("СписокСметы", Тип("ДеревоЗначений"));
	НайденнаяСтрока = ДеревоЗначений.Строки.Найти(ТекЭлемент,"Смета",Истина);	
	// ДокторСофт
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// ДокторСофт
	НайденнаяСтрока.Строки.Очистить();
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		НайденнаяСтрока2 = ДеревоЗначений.Строки.Найти(ТекСтрока.Родитель,"Смета",Истина);	
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаДерева = НайденнаяСтрока2.Строки.Добавить();	
		Иначе
			СтрокаДерева = НайденнаяСтрока.Строки.Добавить();	
		КонецЕсли;			
		ЗаполнитьЗначенияСвойств(СтрокаДерева,ТекСтрока);
		СтрокаДерева.Картинка 		 = ПолучитьКартинкуСтроки(СтрокаДерева.Ссылка, СтрокаДерева.ПометкаУдаления);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"СписокСметы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмету()
	
	ТекДанные = Элементы.СписокСметы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
	
		ЛимЗатрата = Неопределено;
		Если ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
			ЛимЗатрата = ТекДанные.Ссылка;
			Если ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда 	
				ТекИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаДокументаУпр";
			ИначеЕсли ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда 	
				ТекИмяФормы = "Документ.СМ_ОбъектнаяСмета.Форма.ФормаДокументаУпр";
			ИначеЕсли ТипЗнч(ТекДанные.Смета) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда 	
				ТекИмяФормы = "Документ.СМ_СводнаяСмета.Форма.ФормаДокументаУпр";
			Иначе
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекДанные.Ссылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда 	
			ТекИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаДокументаУпр";
		ИначеЕсли ТипЗнч(ТекДанные.Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда 	
			ТекИмяФормы = "Документ.СМ_ОбъектнаяСмета.Форма.ФормаДокументаУпр";
		ИначеЕсли ТипЗнч(ТекДанные.Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда 	
			ТекИмяФормы = "Документ.СМ_СводнаяСмета.Форма.ФормаДокументаУпр";
		Иначе 
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ссылка",ТекДанные.Смета);
		СтруктураПараметров.Вставить("Ключ",ТекДанные.Смета);
		Если Не ЛимЗатрата = Неопределено Тогда
			СтруктураПараметров.Вставить("ЛимЗатрата",ЛимЗатрата);
		КонецЕсли;
		ОткрытьФорму(ТекИмяФормы,СтруктураПараметров);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(ОбъектСтроительства)
	Возврат ОБъектСтроительства.ЭтоГруппа;
КонецФункции

#КонецОбласти
